In [1]:
import pandas as pd

In [7]:
unclean = "./Dataset.csv"
unclean_df = pd.read_csv(unclean);
unclean_df.columns.values

array(['Unnamed: 0', 'Unnamed: 0.1', 'realtime_start', 'realtime_end',
       'date', 'value', 'Date', 'Microsoft Open', 'Close Microsoft',
       'Apple Open', 'Apple Close', 'Amazon Open', 'Amazon Close',
       'IBM Open', 'IBM Close', 'Nike Open', 'Nike Close'], dtype=object)

In [8]:
clean_df = unclean_df.drop(['Unnamed: 0', 'Unnamed: 0.1','realtime_start', 'realtime_end','Microsoft Open', 'Apple Open', 'Amazon Open', 'IBM Open'], axis=1)
clean_df.head()

,date,value,Date,Close Microsoft,Apple Close,Amazon Close,IBM Close,Nike Open,Nike Close
0,1946-01-01,.,3/27/2018,89.47,168.340,1497.05,151.91,65.89,66.17
1,1946-04-01,.,3/26/2018,93.78,172.770,1555.86,153.37,65.08,65.90
2,1946-07-01,.,3/23/2018,87.18,164.940,1495.56,148.89,66.70,64.63
3,1946-10-01,.,3/22/2018,89.79,168.845,1544.10,152.09,65.60,64.42
4,1947-01-01,243.164,3/21/2018,92.48,171.270,1581.86,156.69,66.73,66.35